tap "homebrew/bundle"
tap "homebrew/services"

# -------------------------------------------------------------------
# Core shell + GNU userland
# -------------------------------------------------------------------
brew "bash"
brew "bash-completion"
brew "coreutils"
brew "moreutils"

brew "findutils"
brew "grep"
brew "wget"

# -------------------------------------------------------------------
# CLI essentials
# -------------------------------------------------------------------
brew "ack"
brew "aria2"
brew "direnv"
brew "git"
brew "git-flow"           # uncomment if still needed
brew "git-lfs"
brew "gnupg"
brew "htop"
brew "ncdu"
brew "ripgrep"
brew "tree"
brew "vbindiff"
brew "wakeonlan"
brew "tmux"
brew "tmuxp"

# -------------------------------------------------------------------
# Networking / ops (non-CTF)
# -------------------------------------------------------------------
brew "caddy"
brew "colima"
brew "docker"
brew "docker-compose"
brew "openssh"
brew "ssh-copy-id"
brew "socat"
brew "tcpflow"
brew "tcpreplay"
brew "telnet"
brew "ucspi-tcp"

# -------------------------------------------------------------------
# Languages & runtimes
# -------------------------------------------------------------------
brew "go"
brew "node"
brew "lua"
brew "python@3.13"
brew "rbenv"
brew "rust"

# -------------------------------------------------------------------
# Build / packaging / data + media tools
# -------------------------------------------------------------------
brew "awscli"
brew "azure-cli"
brew "ffmpeg"
brew "ghostscript"
brew "hugo"
brew "mkvtoolnix"
brew "netpbm"
brew "nmap"
brew "pigz"
brew "pngcheck"
brew "pv"
brew "rename"
brew "rlwrap"
brew "woff2"
brew "yt-dlp"
brew "zopfli"

# -------------------------------------------------------------------
# Apps (casks)
# -------------------------------------------------------------------
# Browsers
cask "google-chrome"
cask "firefox"
cask "tor-browser"

# Terminals / IDEs / editors
cask "ghostty"
cask "iterm2"
cask "visual-studio-code"
cask "antigravity"


# Dev tooling
cask "codex"
cask "gcloud-cli"
cask "gpg-suite"
cask "pgadmin4"
cask "postman"
# cask "postgres"

# Productivity / utilities
cask "bitwarden"
cask "elgato-control-center"
cask "onedrive"
cask "stats"
cask "vyprvpn"

# Communication
cask "discord"
cask "microsoft-teams"
cask "signal"
cask "slack"
cask "telegram"
cask "whatsapp"
cask "zoom"

# Media
cask "plexamp"
cask "spotify"
cask "vlc"

# Creative / design
cask "figma"

# Gaming / fun
cask "bluos-controller"
cask "epic-games"
cask "steam"
